# **Filtering a Dataframe based on a condition**

---

In [0]:
import pandas as pd

In [2]:
from google.colab import files
upload = files.upload()

Saving employees.csv to employees.csv

In [0]:
df = pd.read_csv('employees.csv', parse_dates=['Start Date','Last Login Time'])

In [0]:
df['Senior Management'] = df['Senior Management'].astype("bool")

In [0]:
df['Gender'] = df['Gender'].astype('category')

In [6]:
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [8]:
df['Gender'] == 'Male'

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

In [9]:
df[df['Gender'] == 'Male'].head()

  First Name Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas   Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas   Male 1996-03-31  ...   4.170               True              NaN
3      Jerry   Male 2005-03-04  ...   9.340               True          Finance
4      Larry   Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis   Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [10]:
df['Team'] == 'Finance'

0      False
1      False
2       True
3       True
4      False
       ...
995    False
996     True
997    False
998    False
999    False
Name: Team, Length: 1000, dtype: bool

In [11]:
df[df['Team'] == 'Finance'].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management     Team
2       Maria  Female 1993-04-23  ...  11.858              False  Finance
3       Jerry    Male 2005-03-04  ...   9.340               True  Finance
7         NaN  Female 2015-07-20  ...  11.598               True  Finance
14   Kimberly  Female 1999-01-14  ...  14.543               True  Finance
46      Bruce    Male 2009-11-28  ...   6.796              False  Finance

[5 rows x 8 columns]

In [0]:
mask = df['Team'] == 'Finance'

In [13]:
df[mask].head()

   First Name  Gender Start Date  ... Bonus %  Senior Management     Team
2       Maria  Female 1993-04-23  ...  11.858              False  Finance
3       Jerry    Male 2005-03-04  ...   9.340               True  Finance
7         NaN  Female 2015-07-20  ...  11.598               True  Finance
14   Kimberly  Female 1999-01-14  ...  14.543               True  Finance
46      Bruce    Male 2009-11-28  ...   6.796              False  Finance

[5 rows x 8 columns]

In [14]:
df[df['Senior Management']].head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services
6       Ruby  Female 1987-08-17  ...  10.012               True          Product

[5 rows x 8 columns]

In [15]:
df[df['Team'] != 'Marketing'].head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services
5     Dennis    Male 1987-04-18  ...  10.125              False            Legal

[5 rows x 8 columns]

In [16]:
df['Salary'] > 11000

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: Salary, Length: 1000, dtype: bool

In [17]:
df[df['Salary'] >= 110000].head()

   First Name  Gender  ... Senior Management                  Team
2       Maria  Female  ...             False               Finance
3       Jerry    Male  ...              True               Finance
5      Dennis    Male  ...             False                 Legal
9     Frances  Female  ...              True  Business Development
12    Brandon    Male  ...              True       Human Resources

[5 rows x 8 columns]

In [18]:
df[df['Bonus %']<1.5].head()

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
4        Larry    Male 1998-01-24  ...   1.389               True  Client Services
15     Lillian  Female 2016-06-05  ...   1.256              False          Product
58     Theresa  Female 2010-04-11  ...   1.481               True      Engineering
77     Charles    Male 2004-09-14  ...   1.260               True        Marketing
175     Willie    Male 1998-02-17  ...   1.451               True      Engineering

[5 rows x 8 columns]

In [0]:
mask = df['Start Date']<='1985-01-01'

In [20]:
df[mask]

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
10      Louise  Female 1980-08-12  ...  15.132               True              NaN
12     Brandon    Male 1980-12-01  ...  17.492               True  Human Resources
18       Diana  Female 1981-10-23  ...  19.082              False  Client Services
28       Terry    Male 1981-11-27  ...  13.464               True  Client Services
37       Linda  Female 1981-10-19  ...   9.557               True  Client Services
..         ...     ...        ...  ...     ...                ...              ...
982       Rose  Female 1982-04-06  ...   8.639               True  Human Resources
983       John    Male 1982-12-23  ...  11.738              False      Engineering
985    Stephen     NaN 1983-07-10  ...   1.909              False            Legal
986      Donna  Female 1982-11-26  ...  17.999              False        Marketing
996    Phillip    Male 1984-01-31  ...  19.675              False          Finance

[133 rows x 8 columns]